Revit 2027 API
ClassificationEntry Methods
The ClassificationEntry type exposes the following members.
Methods
Name | Description
Dispose
(Inherited from KeyBasedTreeEntry)
Equals | Determines whether the specified object is equal to the current object.
(Inherited from Object)
GetChildrenKeys |  Gets a collection containing the keys of all children entry objects from this entry.
(Inherited from KeyBasedTreeEntry)
GetHashCode | Serves as the default hash function.
(Inherited from Object)
GetType | Gets the Type of the current instance.
(Inherited from Object)
HasBadCategoryId |  Checks if the category id is Revit BuiltInCategory id.
HasBadLevel |  Checks if the level is an integer in range between 1 and 5 inclusive.
HasInvalidKey |  Checks if the key matches the level and parent key.
ToString | Returns a string that represents the current object.
(Inherited from Object)
Top
See Also
Reference
ClassificationEntry Class
Autodesk.Revit.DB Namespace